<!-- 村落概况 -->
<template>
  <div class="overviewOfTheVillage-container">
    <div class="w2">
      <!-- 村咯简介 -->
      <div class="jianjie">
        <div class="title imgfull">
          <div class="titletext">
            {{ oTdata.fist.title }}
          </div>
        </div>
        <div class="template-content-text">
          {{ oTdata.fist.desc }}
        </div>
      </div>
      <!-- 每一项 -->
      <div class="itemss" v-for="item in oTdata.last" :key="item.id">
        <div class="title imgfull">
          <div class="titletext">
            {{ item.title }}
          </div>
        </div>
        <LeftorRightImg
          :direction="item.direction"
          :desc="item.desc"
          :pic="item.pic"
        ></LeftorRightImg>
      </div>
    </div>
  </div>
</template>
<script>
import LeftorRightImg from "@/components/villageDetails/components/LeftorRightImg.vue";
export default {
  components: { LeftorRightImg },
  name: "overviewOfTheVillage",
  props: ["id", "oTdata"],
  data() {
    return {
      //       oTdata: {
      //         fist: {
      //           title: 'http://webapp.xiaoheitech.cn/vizen-village-gz/images/villageDetails/BASIC_INFO/INTRODUCTION.png',
      //           desc: `季刀苗寨位于巴拉河畔，距离黔东南苗族侗族自治州州府凯里东南部20公里。季刀苗寨分为上下两寨，依山傍水，有百年古道、百年粮仓、百年古歌。季刀有四大特色，一是踏百年古道，体验老百姓的勤劳;二是看百年粮仓，遥想劳动人民的智慧；三是听百年古歌，观民间文化；四是望百年古树，思世事沧桑；五是游巴拉河河水，享清泉飞流之欢畅。
      //           季刀整个寨子以吊脚楼为主，民风淳朴。`
      //         },
      //         last: [
      //           {
      //             id: 1,
      //             title: 'http://webapp.xiaoheitech.cn/vizen-village-gz/images/villageDetails/BASIC_INFO/VILLAGE_HISTORY.png',
      //             desc: '"季刀在何时建寨由于没有汉文献资料记载而无考，根据季刀老人的回忆，其家族是从今江西南昌迁徙而来，老人的始祖定居季刀苗寨已有600多年。季刀苗寨的百年粮仓，始建于清朝道光年间，至今已有二三百年的历史，当时，寨子人口少，住房分散，粮仓也随各户修建，由于社会治安差，盗贼抢劫和火灾时有发生，粮食遭受严重损失，人们为之惶恐不安。因山谷溪水从这里顺流而下，这里又是寨子的心脏地带，在村寨长老的建议下，人们都把粮仓搬到此地集中修建，在粮仓四周修建住房防守，并建了寨门。这样，既防火又防盗，粮食不再遭受损失，人们安居乐业，百年粮仓从此世世代代保存下来。"',
      //             direction: 'right',
      //             pic: 'https://resource-1258796684.cos.ap-shanghai.myqcloud.com/station/2023/1/202319181720871%20%2B%202037855120.jpg'
      //           }, {
      //             id: 2,
      //             title: 'http://webapp.xiaoheitech.cn/vizen-village-gz/images/villageDetails/BASIC_INFO/HISTORY_OBJECT.png',
      //             desc: '"潘启忠，出生于1900年前后，1929年去世。是季刀历史上的知名人物。早年在都匀读书，后又转到贵阳求学。由于当时贵州没有大学，他决定和他的同学到南京去考大学。到达武汉时，被同乡拉去做军官，副师级干部。由于当时所在的军队军饷困难，他便写信给蒋介石求助，蒋介石收到信之后，觉得他写的字和内容很好，认为他是个可用之才，于是便回信告知让他到南京任职。信寄回来的时候被师长看到，便心生嫉妒，他觉得他在这里工作了很多年都没有得到赏识，也没有升职，心里不平衡，之后下毒把潘启忠毒死了。今天潘年武家依然存有他入伍的照片。 潘启忠年轻的时候，他家不是很穷，每逢他读书放假回来之后，他便到处游走，遇到家里穷苦的人的时候，他就告诉他们不要焦虑，并且经常给他们提供帮助。还宣扬一些进步思潮。 1.改土归流 雍正改土归流以前，季刀位于苗疆腹地，不受国家管辖，是化外之区。雍正四年（1726年）春，以鄂尔泰为云贵总督，鄂尔泰上疏奏言：“云贵大患无如苗蛮，欲安民必先制夷，欲制夷必先改土归流；而苗疆多与邻省犬牙相错，又必归并事权，始可一劳永逸。”鄂尔泰据前任总督高其倬所奏：“都匀以东，黎平以西，中央生苗一区，名古州、八万，地大苗众，正须料理。”雍正六年（1728年），贵州巡抚张广泗奉鄂尔泰之命，由贵阳率领大军前往都匀，进攻八寨（今丹寨县）。“八寨为都匀要隘,丹江、清江、古州之咽喉，窟穴其中为黑”。焚烧苗寨数十，经过近五个月的征剿，把八寨地区的苗族人民镇压下去。抚附近生苗，其极远之千家寨,俱先后归化”，随后“建城建官”。又因“丹江与八寨密迩，而清江、古州诸地亦犬牙交错，生苗声气相通，盘踞其中者为桃绕等四十余寨，名大丹江，左为乌叠等二十余寨为藩篱，名小丹江，右有鸡讲等十余寨，地近九股”。张广泗便率兵进取丹江。“相度形势，乌耶为大小丹江要隘，抱得亦为大小丹江出没之区，乌骚则延属鸡讲”，于是调副将苏大有由八寨九门出发,历时半年方定。在丹江(今雷山县)建城设官,隶属都匀府。随后在雍正七年（1729年），先后平定清江（今剑河县）、古州（今榕江县）、都江厅（今三都县），雍正八年（1730年）平定清江（今剑河县），雍正十一年（1733年）平定台拱（今台江县）。随后设立八寨厅、丹江厅、都江厅、古州厅、清江厅、台拱厅，在历史上称之为“新疆六厅”或“苗疆六厅”。在设置的过程中，季刀隶属于丹江厅，首次纳入王朝国家的版图（资料出处：民贵《贵州通志》）。 2.咸同起义 雍正年间，在苗疆腹地设立新疆六厅，为了稳定社会秩序，发展经济，谕令“永不征赋”。随着清王朝统治的日益腐朽，地方官员也伺机开始盘剥苗民，征收高额赋税徭役，令广大苗民苦不堪言。据《苗族历史与文化》载：咸丰五年(1855年)，丹江厅七八个屯军来到郎德苗寨逼迫苗民交粮纳税，一个年过花甲的苗族老人，竟然被屯军以抗粮为由吊起来活活打死了。郎德后生陈杀略怒不可遏，二话不说，顺手抓起一根碗口粗的大木棒，猛朝刽子手脑壳劈去，杀死了这个屯兵，愤怒的郎德青壮年也尾随他一拥而上，把所有催粮逼款的屯兵吓跑了。陈杀略棒打屯军，点燃了起义的导火绳，因杀屯兵为郎德人，苗语称“答乃郎打喽”，清军便把“郎打喽”记成了“杨大六”。 朗德离季刀仅十数里，杨大六举旗起义后，巴拉河上下游的苗寨纷纷响应。起义军以郎德为大本营，筑起了两道防线，山顶上筑碉堡，建立火药库，山坳设门楼炮台，护寨山上设一岗哨，在官马大路上修起了“大六桥”，桥上架起了楼炮台，唐防坡上还修起了练兵场。郎德杨大六的威名迅速在黔东南传开，苗民感到出气的日子到来，方圆百里的寨子都纷纷前来投靠。清文人徐家干《苗疆闻见录》记载：“咸丰五年三月十七日，有充勇湘、粤遣散而归者数百人，以聚众入城，声言须永免徭赋，并将汉民占得田宅概行给还，方肯罢去。台丞无如何，派死士数十人，乘苗不意，缱城冲击，毙苗多名，苗散去，心怀不服”。于是苗民商议“自来甲寅乙卯，乃我苗乱之期，天时人事，势不能已；今若此亦复何能带也”。杨大六带领一些随从来到台拱与张秀眉、包大度、李鸿基等人商量起义之事。张秀眉见起义的时机已经成熟，于是在蚂蚁寨杀牛议榔，以刻木加鸡毛、火炭片传各寨，约期起事。一时间，千里苗疆，莫不相应。史称咸同苗民起义。（资料出处：《苗族历史与文化》、《苗疆闻见录》） 3.季刀下寨在1987年发生过一场火灾，全寨烧毁建筑较多，只有3栋建筑遗存下来，因此村寨建筑多为重建。"',
      //             direction: 'left',
      //             pic: 'https://resource-1258796684.cos.ap-shanghai.myqcloud.com/station/2023/1/2023113111558493%20%2B%202020292417.png'
      //           }, {
      //             id: 3,
      //             title: 'http://webapp.xiaoheitech.cn/vizen-village-gz/images/villageDetails/BASIC_INFO/HISTORY_STORY.png',
      //             desc: `
      //                     一、牛马脚印的来历。关于牛马脚印的来历。传说在远古时候，天上有十二个太阳和十二个月亮，他们的名字根据天干地支来取的，白天只能一个太阳出来，晚上只能一个月亮出来，所以他们是轮流出来的。有一天白天，十二个太阳全出来了，炙烤着整个天地。大地上，岩石都被烧烤熔了，树木枯焦、水源绝继，天河也干涸了，人畜都找不到水喝，人们艰难地在烈日和缺水下生活。这里还幸存一股小水源、长年不断。人们都从四面八方到这里取水喝。天上的仙人也拉着神牛神马到这里来饮水。由此留下了永不磨灭的牛马脚印。
      // 二、埋坛山的传说。关于埋坛山的传说。相传很久很久以前，寨子经常发生火灾。人们经过大火洗劫后，都很重视防火工作，但火灾也还时有发生，在这种情况下，长老们便请巫师来看，巫师看后说，寨子对面的山是个火把，对着寨子烧，您们必须在村背后大山顶上安放一个大坛，并择吉日良辰请巫师念佛咒经，请天上神灵保佑。从此，这座山就叫埋坛山，几百年来，寨子再也没有发生过火灾。尽管这段故事有迷信色彩不可信，但却反映了老百姓祈求平安的愿望。
      // 三、鼓藏场的故事。关于鼓藏场的故事。相传本寨祖先，喜爱铜鼓和芦笙，逢年过节，吹芦笙、跳铜鼓，热闹非凡。后来，铜鼓场架鼓的木柱朽了，需要更换，寨老们上山反复挑选，最后选中了一根笔直较好的树子，在择好吉日上山去砍树时，发现有一人被老虎咬死在树脚下，长老们觉得不吉利，若要这根树子来架鼓，等于“引狼入室”，树也不砍了，回来后便把铜鼓埋了，并立下遗嘱：后代不得再搞铜鼓，从此，寨子的铜鼓便销声匿迹了。
      // 四、神仙洞的故事。神仙洞洞口大概有三平米左右，从洞口进去，白天什么都看不见，但是晚上的时候就能看见仙女举着火把跳着飞舞，有时候合成一个大大的火把，有时候合成一个小的。有一天一个村民到洞上面砍柴，不小心摔下来了，仙女听到声音后把他救了下来，那个人回到村里就和村民们说，有村民不相信，就去捉弄仙女。他爬到洞上面往下扔石头，仙女听到声音后就出来看，发现是石头，一气之下就把洞门关了，神仙洞也不复存在了。`,
      //             direction: 'left',
      //             pic: 'https://resource-1258796684.cos.ap-shanghai.myqcloud.com/station/2023/1/20231131124765%20%2B%201530021460.jpeg'
      //           }
      //         ]
      //       }
    };
  },
  methods: {},
  computed: {},
  watch: {},
  created() {},
  mounted() {},
};
</script>
<style lang='less' scpoed>
.overviewOfTheVillage-container {
  width: 100%;
  // height: 100vh;
  height: 100%;
  background: url("../../../assets/images/bg-top.png") no-repeat;
  background-size: 100% 100%;
  display: flex;
  flex-direction: column;
  align-items: center;

  .w2 {
    .title {
      width: 139px;
      height: 29px;
      // margin: 80px 0 60px 0;
      margin: 40px auto;
    }

    .jianjie {
      .template-content-text {
        font-size: 14px;
        font-family: PingFangSC-Regular, PingFang SC;
        font-weight: 400;
        color: #333333;
        line-height: 28px;
        letter-spacing: 2px;
        text-indent: 2em;
        max-height: 476px;
        text-align: left;
        overflow: auto;
      }
    }
  }
}
</style>